apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_edma.c
/****************************************************************************
 * arch/arm/src/s32k3xx/s32k3xx_edma.c
 *
 *   Copyright (C) 2019, 2021, 2023 Gregory Nutt. All rights reserved.
 *   Copyright 2022 NXP
 *   Authors: Gregory Nutt <gnutt@nuttx.org>
 *            David Sidrane <david.sidrane@nscdg.com>
 *            Peter van der Perk <peter.vanderperk@nxp.com>
 *
 * This file was leveraged from the NuttX S32K1 port.  Portions of that eDMA
 * logic derived from NXP sample code which has a compatible BSD 3-clause
 * license:
 *
 *   Copyright (c) 2015, Freescale Semiconductor, Inc.
 *   Copyright 2016-2017 NXP
 *   All rights reserved
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <assert.h>
#include <debug.h>
#include <errno.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/queue.h>
#include <nuttx/spinlock.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>

#include "arm_internal.h"
#include "sched/sched.h"

#include "chip.h"
#include "hardware/s32k3xx_edma.h"
#include "hardware/s32k3xx_dmamux.h"
#include "s32k3xx_edma.h"
#include "s32k3xx_clocknames.h"
#include "s32k3xx_periphclocks.h"

#ifdef CONFIG_S32K3XX_EDMA

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* TCD Alignment.
 *
 * eDMA TCDs must be aligned with the D-Cache line boundaries to facilitate
 * cache operations on the TCDs when the D-Cache is enabled.
 *
 * NOTE:  The TCDs are 32-bytes in length.  We implicitly assume that the
 * D-Cache line size is also 32-bits.  Otherwise, padding would be required
 * at the ends of the TCDS and buffers to protect data after the end of from
 * invalidation.
 */

#ifdef CONFIG_ARMV7M_DCACHE
#  define EDMA_ALIGN  ARMV7M_DCACHE_LINESIZE
#else
/* 32 byte alignment for TCDs is required for scatter gather */

#define EDMA_ALIGN        32
#endif

#define EDMA_ALIGN_MASK   (EDMA_ALIGN - 1)
#define EDMA_ALIGN_UP(n)  (((n) + EDMA_ALIGN_MASK) & ~EDMA_ALIGN_MASK)

#ifdef CONFIG_S32K3XX_DTCM_HEAP
#  define DTCM_BACKDOOR_OFFSET 0x1000000
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* State of a DMA channel */

enum s32k3xx_dmastate_e
{
  S32K3XX_DMA_IDLE = 0,             /* No DMA in progress */
  S32K3XX_DMA_CONFIGURED,           /* DMA configured, but not yet started */
  S32K3XX_DMA_ACTIVE                /* DMA has been started and is in progress */
};

/* This structure describes one DMA channel */

struct s32k3xx_dmach_s
{
  uint8_t chan;                   /* DMA channel number (0-S32K3XX_EDMA_NCHANNELS) */
  bool inuse;                     /* true: The DMA channel is in use */
  uint8_t dmamux;                 /* The DMAMUX channel selection */
  uint8_t state;                  /* Channel state.  See enum s32k3xx_dmastate_e */
  uint32_t flags;                 /* DMA channel flags */
  edma_callback_t callback;       /* Callback invoked when the DMA completes */
  void *arg;                      /* Argument passed to callback function */

#if CONFIG_S32K3XX_EDMA_NTCD > 0
  /* That TCD list is linked through the DLAST SGA field.  The first transfer
   * to be performed is at the head of the list.  Subsequent TCDs are added
   * at the tail of the list.
   */

  struct s32k3xx_edmatcd_s *head;   /* First TCD in the list */
  struct s32k3xx_edmatcd_s *tail;   /* Last TCD in the list */
#endif
};

/* This structure describes the state of the eDMA controller */

struct s32k3xx_edma_s
{
  /* These mutex protect the DMA channel and descriptor tables */

  mutex_t chlock;                 /* Protects channel table */
#if CONFIG_S32K3XX_EDMA_NTCD > 0
  sem_t dsem;                     /* Supports wait for free descriptors */
#endif

  /* This array describes each DMA channel */

  struct s32k3xx_dmach_s dmach[S32K3XX_EDMA_NCHANNELS];
  spinlock_t lock;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

uintptr_t const S32K3XX_EDMA_TCD[S32K3XX_EDMA_NCHANNELS] =
{
  S32K3XX_EDMA_CH0_CSR,
  S32K3XX_EDMA_CH1_CSR,
  S32K3XX_EDMA_CH2_CSR,
  S32K3XX_EDMA_CH3_CSR,
  S32K3XX_EDMA_CH4_CSR,
  S32K3XX_EDMA_CH5_CSR,
  S32K3XX_EDMA_CH6_CSR,
  S32K3XX_EDMA_CH7_CSR,
  S32K3XX_EDMA_CH8_CSR,
  S32K3XX_EDMA_CH9_CSR,
  S32K3XX_EDMA_CH10_CSR,
  S32K3XX_EDMA_CH11_CSR,
  S32K3XX_EDMA_CH12_CSR,
  S32K3XX_EDMA_CH13_CSR,
  S32K3XX_EDMA_CH14_CSR,
  S32K3XX_EDMA_CH15_CSR,
  S32K3XX_EDMA_CH16_CSR,
  S32K3XX_EDMA_CH17_CSR,
  S32K3XX_EDMA_CH18_CSR,
  S32K3XX_EDMA_CH19_CSR,
  S32K3XX_EDMA_CH20_CSR,
  S32K3XX_EDMA_CH21_CSR,
  S32K3XX_EDMA_CH22_CSR,
  S32K3XX_EDMA_CH23_CSR,
  S32K3XX_EDMA_CH24_CSR,
  S32K3XX_EDMA_CH25_CSR,
  S32K3XX_EDMA_CH26_CSR,
  S32K3XX_EDMA_CH27_CSR,
  S32K3XX_EDMA_CH28_CSR,
  S32K3XX_EDMA_CH29_CSR,
  S32K3XX_EDMA_CH30_CSR,
  S32K3XX_EDMA_CH31_CSR
};

/* The state of the eDMA */

