apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_edma.c
static struct s32k3xx_edma_s g_edma =
{
  .chlock = NXMUTEX_INITIALIZER,
#if CONFIG_S32K3XX_EDMA_NTCD > 0
  .dsem = SEM_INITIALIZER(CONFIG_S32K3XX_EDMA_NTCD),
#endif
  .lock = SP_UNLOCKED
};

#if CONFIG_S32K3XX_EDMA_NTCD > 0
/* This is a singly-linked list of free TCDs */

static sq_queue_t g_tcd_free;

/* This is a pool of pre-allocated TCDs */

static struct s32k3xx_edmatcd_s g_tcd_pool[CONFIG_S32K3XX_EDMA_NTCD]
              aligned_data(EDMA_ALIGN);
#endif

const struct peripheral_clock_config_s edma_clockconfig[] =
{
#if S32K3XX_EDMA_NCHANNELS > 0
  {
    .clkname = EDMA_TCD0_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 1
  {
    .clkname = EDMA_TCD1_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 2
  {
    .clkname = EDMA_TCD2_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 3
  {
    .clkname = EDMA_TCD3_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 4
  {
    .clkname = EDMA_TCD4_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 5
  {
    .clkname = EDMA_TCD5_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 6
  {
    .clkname = EDMA_TCD6_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 7
  {
    .clkname = EDMA_TCD7_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 8
  {
    .clkname = EDMA_TCD8_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 9
  {
    .clkname = EDMA_TCD9_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 10
  {
    .clkname = EDMA_TCD10_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 11
  {
    .clkname = EDMA_TCD11_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 12
  {
    .clkname = EDMA_TCD12_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 13
  {
    .clkname = EDMA_TCD13_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 14
  {
    .clkname = EDMA_TCD14_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 15
  {
    .clkname = EDMA_TCD15_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 16
  {
    .clkname = EDMA_TCD16_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 17
  {
    .clkname = EDMA_TCD17_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 18
  {
    .clkname = EDMA_TCD18_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 19
  {
    .clkname = EDMA_TCD19_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 20
  {
    .clkname = EDMA_TCD20_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 21
  {
    .clkname = EDMA_TCD21_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 22
  {
    .clkname = EDMA_TCD22_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 23
  {
    .clkname = EDMA_TCD23_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 24
  {
    .clkname = EDMA_TCD24_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 25
  {
    .clkname = EDMA_TCD25_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 26
  {
    .clkname = EDMA_TCD26_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 27
  {
    .clkname = EDMA_TCD27_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 28
  {
    .clkname = EDMA_TCD28_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 29
  {
    .clkname = EDMA_TCD29_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 30
  {
    .clkname = EDMA_TCD30_CLK,
    .clkgate = true,
  },
#endif
#if S32K3XX_EDMA_NCHANNELS > 31
  {
    .clkname = EDMA_TCD31_CLK,
    .clkgate = true,
  },
#endif
};

/****************************************************************************
 * Public Data
 ****************************************************************************/

#ifdef CONFIG_S32K3XX_DTCM_HEAP
extern uint8_t DTCM_BASE_ADDR[];
extern uint8_t DTCM_END_ADDR[];
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: s32k3xx_tcd_alloc
 *
 * Description:
 *   Allocate an in-memory, TCD
 *
 ****************************************************************************/

#if CONFIG_S32K3XX_EDMA_NTCD > 0
static struct s32k3xx_edmatcd_s *s32k3xx_tcd_alloc(void)
{
  struct s32k3xx_edmatcd_s *tcd;
  irqstate_t flags;

  /* Take the 'dsem'.  When we hold the 'dsem', then we know that one
   * TCD is reserved for us in the free list.
   *
   * NOTE: We use a critical section here because we may block waiting for
   * the 'dsem'.  The critical section will be suspended while we are
   * waiting.
   */

  nxsem_wait_uninterruptible(&g_edma.dsem);

  /* Now there should be a TCD in the free list reserved just for us */

  flags = spin_lock_irqsave(&g_edma.lock);
  tcd = (struct s32k3xx_edmatcd_s *)sq_remfirst(&g_tcd_free);
  DEBUGASSERT(tcd != NULL);

  spin_unlock_irqrestore(&g_edma.lock, flags);
  return tcd;
}
#endif

/****************************************************************************
 * Name: s32k3xx_tcd_free
 *
 * Description:
 *   Free an in-memory, TCD
 *
 ****************************************************************************/

#if CONFIG_S32K3XX_EDMA_NTCD > 0
static void s32k3xx_tcd_free_nolock(struct s32k3xx_edmatcd_s *tcd)
{
  /* Add the TCD to the end of the free list and post the 'dsem',
   * possibly waking up another thread that might be waiting for
   * a TCD.
   */

  sq_addlast((sq_entry_t *)tcd, &g_tcd_free);
  nxsem_post(&g_edma.dsem);
}

static void s32k3xx_tcd_free(struct s32k3xx_edmatcd_s *tcd)
{
  irqstate_t flags;

  /* Add the TCD to the end of the free list and post the 'dsem',
   * possibly waking up another thread that might be waiting for
   * a TCD.
   */

  flags = spin_lock_irqsave_nopreempt(&g_edma.lock);
  s32k3xx_tcd_free_nolock(tcd);
  spin_unlock_irqrestore_nopreempt(&g_edma.lock, flags);
}
#endif

/****************************************************************************
 * Name: s32k3xx_tcd_initialize()
 *
 * Description:
 *   Initialize the TCD free list from the pool of pre-allocated TCDs.
 *
 * Assumptions:
 *   Called early in the initialization sequence so no special protection is
 *   necessary.
 *
 ****************************************************************************/

#if CONFIG_S32K3XX_EDMA_NTCD > 0
static inline void s32k3xx_tcd_initialize(void)
{
  sq_entry_t *tcd;
  int i;

  /* Add each pre-allocated TCD to the tail of the TCD free list */

  sq_init(&g_tcd_free);
  for (i = 0; i < CONFIG_S32K3XX_EDMA_NTCD; i++)
    {
      tcd = (sq_entry_t *)&g_tcd_pool[i];
      sq_addlast(tcd, &g_tcd_free);
    }
}
#endif

/****************************************************************************
 * Name: s32k3xx_tcd_chanlink
 *
 * Description:
 *   This function configures either a minor link or a major link. The minor
 *   link means the channel link is triggered every time CITER decreases by 1
 *   The major link means that the channel link  is triggered when the CITER
 *   is exhausted.
 *
 *   NOTE: Users should ensure that DONE flag is cleared before calling this
 *   interface, or the configuration is invalid.
 *
 * Input Parameters:
 *   tcd  - Point to the TCD structure.
 *   type - Channel link type.
 *   chan - The linked channel number.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_S32K3XX_EDMA_ELINK
static inline void s32k3xx_tcd_chanlink(uint8_t flags,
                                        struct s32k3xx_dmach_s *linkch,
                                        struct s32k3xx_edmatcd_s *tcd)
{
  uint16_t regval16;

