apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_edma.c
  flags &= EDMA_CONFIG_LINKTYPE_MASK;

  if (linkch == NULL || flags == EDMA_CONFIG_LINKTYPE_LINKNONE)
    {
      /* No link or no link channel provided */

      /* Disable minor links */

      /* Disable major link */

      tcd->csr   &= ~EDMA_TCD_CSR_MAJORELINK;
    }
  else if (flags == EDMA_CONFIG_LINKTYPE_MINORLINK) /* Minor link config */
    {
      /* Enable minor link */

      tcd->citer |= EDMA_TCD_CITER_ELINK;
      tcd->biter |= EDMA_TCD_BITER_ELINK;

      /* Set linked channel */

      regval16    = tcd->citer;
      regval16   &= ~EDMA_TCD_CITER_LINKCH_MASK;
      regval16   |= EDMA_TCD_CITER_LINKCH(linkch->chan);
      tcd->citer  = regval16;

      regval16    = tcd->biter;
      regval16   &= ~EDMA_TCD_BITER_LINKCH_MASK;
      regval16   |= EDMA_TCD_BITER_LINKCH(linkch->chan);
      tcd->biter  = regval16;
    }
  else /* if (flags == EDMA_CONFIG_LINKTYPE_MAJORLINK)  Major link config */
    {
      /* Enable major link */

      regval16    = tcd->csr;
      regval16   |= EDMA_TCD_CSR_MAJORELINK;
      tcd->csr    = regval16;

      /* Set major linked channel */

      regval16   &= ~EDMA_TCD_CSR_MAJORLINKCH_MASK;
      regval16   |=  EDMA_TCD_CSR_MAJORLINKCH(linkch->chan);
      tcd->csr    = regval16;
    }
}
#endif

/****************************************************************************
 * Name: s32k3xx_tcd_configure
 *
 * Description:
 *  Configure all TCD registers to the specified values.  'tcd' is an
 *  'overlay' that may refer either to either the TCD register set or to an
 *  in-memory TCD structure.
 *
 ****************************************************************************/

static inline void s32k3xx_tcd_configure(struct s32k3xx_edmatcd_s *tcd,
                            const struct s32k3xx_edma_xfrconfig_s *config)
{
  tcd->saddr    = config->saddr;
  tcd->soff     = config->soff;
  tcd->attr     = EDMA_TCD_ATTR_SSIZE(config->ssize) |  /* Transfer Attributes */
                  EDMA_TCD_ATTR_DSIZE(config->dsize);
#ifdef CONFIG_S32K3XX_EDMA_MOD
  tcd->attr     |= EDMA_TCD_ATTR_SMOD(config->smod) |  /* Transfer Attributes */
                   EDMA_TCD_ATTR_DMOD(config->dmod);
#endif
  tcd->nbytes   = config->nbytes;
  tcd->slast    = config->flags & EDMA_CONFIG_LOOPSRC ?
                                  -(config->iter * config->nbytes) : 0;

  tcd->daddr    = config->daddr;
  tcd->doff     = config->doff;
  tcd->citer    = config->iter & EDMA_TCD_CITER_MASK;
  tcd->biter    = config->iter & EDMA_TCD_BITER_MASK;
  tcd->csr      = config->flags & EDMA_CONFIG_LOOP_MASK ?
                                  0 : EDMA_TCD_CSR_DREQ;
  tcd->csr     |= config->flags & EDMA_CONFIG_INTHALF ?
                                  EDMA_TCD_CSR_INTHALF : 0;
  tcd->dlastsga = config->flags & EDMA_CONFIG_LOOPDEST ?
                                  -(config->iter * config->nbytes) : 0;

#ifdef CONFIG_S32K3XX_DTCM_HEAP
  /* Remap address to backdoor address for eDMA */

  if (tcd->saddr >= (uint32_t)DTCM_BASE_ADDR &&
      tcd->saddr < (uint32_t)DTCM_END_ADDR)
    {
        tcd->saddr += DTCM_BACKDOOR_OFFSET;
    }

  if (tcd->daddr >= (uint32_t)DTCM_BASE_ADDR &&
      tcd->daddr < (uint32_t)DTCM_END_ADDR)
    {
        tcd->daddr += DTCM_BACKDOOR_OFFSET;
    }
#endif

  /* And special case flags */

#ifdef CONFIG_S32K3XX_EDMA_ELINK
  /* Configure major/minor link mapping */

  s32k3xx_tcd_chanlink(config->flags,
                       (struct s32k3xx_dmach_s *)config->linkch,
                       tcd);
#endif
}

/****************************************************************************
 * Name: s32k3xx_tcd_instantiate
 *
 * Description:
 *   Copy an in-memory TCD into eDMA channel TCD registers
 *
 ****************************************************************************/

#if CONFIG_S32K3XX_EDMA_NTCD > 0
static void s32k3xx_tcd_instantiate(struct s32k3xx_dmach_s *dmach,
                                    const struct s32k3xx_edmatcd_s *tcd)
{
  uintptr_t base = S32K3XX_EDMA_TCD[dmach->chan];

  /* Push tcd into hardware TCD register */

  /* Clear DONE bit first, otherwise ESG cannot be set */

  putreg16(0,             base + S32K3XX_EDMA_TCD_CSR_OFFSET);

  putreg32(tcd->saddr,    base + S32K3XX_EDMA_TCD_SADDR_OFFSET);
  putreg16(tcd->soff,     base + S32K3XX_EDMA_TCD_SOFF_OFFSET);
  putreg16(tcd->attr,     base + S32K3XX_EDMA_TCD_ATTR_OFFSET);
  putreg32(tcd->nbytes,   base + S32K3XX_EDMA_TCD_NBYTES_OFFSET);
  putreg32(tcd->slast,    base + S32K3XX_EDMA_TCD_SLAST_SDA_OFFSET);
  putreg32(tcd->daddr,    base + S32K3XX_EDMA_TCD_DADDR_OFFSET);
  putreg16(tcd->doff,     base + S32K3XX_EDMA_TCD_DOFF_OFFSET);
  putreg16(tcd->citer,    base + S32K3XX_EDMA_TCD_CITER_OFFSET);
  putreg32(tcd->dlastsga, base + S32K3XX_EDMA_TCD_DLAST_SGA_OFFSET);

  putreg16(tcd->csr,      base + S32K3XX_EDMA_TCD_CSR_OFFSET);

  putreg16(tcd->biter,    base + S32K3XX_EDMA_TCD_BITER_OFFSET);
}
#endif

/****************************************************************************
 * Name: s32k3xx_dmaterminate
 *
 * Description:
 *   Terminate the DMA transfer and disable the DMA channel
 *
 ****************************************************************************/

static void s32k3xx_dmaterminate(struct s32k3xx_dmach_s *dmach, int result)
{
#if CONFIG_S32K3XX_EDMA_NTCD > 0
  struct s32k3xx_edmatcd_s *tcd;
  struct s32k3xx_edmatcd_s *next;
#endif
  uint8_t chan;
  edma_callback_t callback;
  irqstate_t flags;
  void *arg;

  flags = spin_lock_irqsave_nopreempt(&g_edma.lock);

  chan            = dmach->chan;

  /* Disable channel IRQ requests */

  putreg32(EDMA_CH_INT, S32K3XX_EDMA_TCD[chan] + S32K3XX_EDMA_CH_INT_OFFSET);

  /* Clear CSR to disable channel. Because if the given channel started,
   * transfer CSR will be not zero. Because if it is the last transfer, DREQ
   * will be set.  If not, ESG will be set.
   */

  putreg32(0, S32K3XX_EDMA_TCD[chan] + S32K3XX_EDMA_CH_CSR_OFFSET);

  putreg16(0, S32K3XX_EDMA_TCD[chan] + S32K3XX_EDMA_TCD_CSR_OFFSET);

  /* Cancel next TCD transfer. */

  putreg32(0, S32K3XX_EDMA_TCD[chan] + S32K3XX_EDMA_TCD_DLAST_SGA_OFFSET);

#if CONFIG_S32K3XX_EDMA_NTCD > 0
  /* Return all allocated TCDs to the free list */

