apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_edma.c
  if ((regval32 & EDMA_CH_CSR_DONE) == 0)
    {
      /* Calculate the unfinished bytes */

      regval16 = getreg16(S32K3XX_EDMA_TCD[dmach->chan]
                   + S32K3XX_EDMA_TCD_CITER_OFFSET);

      if ((regval16 & EDMA_TCD_CITER_ELINK) != 0)
        {
          remaining = (regval16 & EDMA_TCD_CITER_MASK_ELINK) >>
                      EDMA_TCD_CITER_SHIFT;
        }
      else
        {
          remaining = (regval16 & EDMA_TCD_CITER_MASK) >>
                       EDMA_TCD_CITER_SHIFT;
        }
    }

  return remaining;
}

/****************************************************************************
 * Name: s32k3xx_dmach_idle
 *
 * Description:
 *   This function checks if the dma is idle
 *
 * Returned Value:
 *   0  - if idle
 *   !0 - not
 *
 ****************************************************************************/

unsigned int s32k3xx_dmach_idle(DMACH_HANDLE handle)
{
  struct s32k3xx_dmach_s *dmach = (struct s32k3xx_dmach_s *)handle;
  return dmach->state == S32K3XX_DMA_IDLE ? 0 : -1;
}

/****************************************************************************
 * Name: s32k3xx_dmasample
 *
 * Description:
 *   Sample DMA register contents
 *
 * Assumptions:
 *   - DMA handle allocated by s32k3xx_dmach_alloc()
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_DMA
void s32k3xx_dmasample(DMACH_HANDLE handle, struct s32k3xx_dmaregs_s *regs)
{
  struct s32k3xx_dmach_s *dmach = (struct s32k3xx_dmach_s *)handle;
  uintptr_t regaddr;
  unsigned int chan;
  irqstate_t flags;
  uintptr_t base = S32K3XX_EDMA_TCD[dmach->chan];

  DEBUGASSERT(dmach != NULL && regs != NULL);
  chan           = dmach->chan;
  regs->chan     = chan;

  /* eDMA Global Registers */

  flags          = spin_lock_irqsave(&g_edma.lock);

  regs->cr       = getreg32(S32K3XX_EDMA_CSR);  /* Control */
  regs->es       = getreg32(S32K3XX_EDMA_ES);   /* Error Status */
  regs->req      = getreg32(S32K3XX_EDMA_INT);  /* Interrupt Request */
  regs->hrs      = getreg32(S32K3XX_EDMA_HRS);  /* Hardware Request Status */

  /* eDMA TCD */

  regs->saddr    = getreg32(base + S32K3XX_EDMA_TCD_SADDR_OFFSET);
  regs->soff     = getreg16(base + S32K3XX_EDMA_TCD_SOFF_OFFSET);
  regs->attr     = getreg16(base + S32K3XX_EDMA_TCD_ATTR_OFFSET);
  regs->nbml     = getreg32(base + S32K3XX_EDMA_TCD_NBYTES_OFFSET);
  regs->slast    = getreg32(base + S32K3XX_EDMA_TCD_SLAST_SDA_OFFSET);
  regs->daddr    = getreg32(base + S32K3XX_EDMA_TCD_DADDR_OFFSET);
  regs->doff     = getreg16(base + S32K3XX_EDMA_TCD_DOFF_OFFSET);
  regs->citer    = getreg16(base + S32K3XX_EDMA_TCD_CITER_OFFSET);
  regs->dlastsga = getreg32(base + S32K3XX_EDMA_TCD_DLAST_SGA_OFFSET);
  regs->csr      = getreg16(base + S32K3XX_EDMA_TCD_CSR_OFFSET);
  regs->biter    = getreg16(base + S32K3XX_EDMA_TCD_BITER_OFFSET);

  /* DMAMUX registers */

  if (chan < 16)
    {
      regs->dmamux   = getreg32(S32K3XX_DMAMUX0_CHCFG(chan)); /* Channel configuration */
    }
  else
    {
      regs->dmamux   = getreg32(S32K3XX_DMAMUX1_CHCFG(chan - 16)); /* Channel configuration */
    }

  spin_unlock_irqrestore(&g_edma.lock, flags);
}
#endif /* CONFIG_DEBUG_DMA */

/****************************************************************************
 * Name: s32k3xx_dmadump
 *
 * Description:
 *   Dump previously sampled DMA register contents
 *
 * Assumptions:
 *   - DMA handle allocated by s32k3xx_dmach_alloc()
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_DMA
void s32k3xx_dmadump(const struct s32k3xx_dmaregs_s *regs, const char *msg)
{
  unsigned int chan;

  DEBUGASSERT(regs != NULL && msg != NULL);

  chan = regs->chan;
  DEBUGASSERT(chan < S32K3XX_EDMA_NCHANNELS);

  dmainfo("%s\n", msg);
  dmainfo("  eDMA Global Registers:\n");
  dmainfo("          CR: %08x\n", (unsigned int)regs->cr);
  dmainfo("          ES: %08x\n", (unsigned int)regs->es);
  dmainfo("         INT: %08x\n", (unsigned int)regs->req);
  dmainfo("        EARS: %08x\n", (unsigned int)regs->hrs);

  /* eDMA Channel registers */

  dmainfo("  eDMA Channel %u Registers:\n", chan);
  dmainfo("    DCHPRI: %02x\n", regs->dchpri);

  /* eDMA TCD */

  dmainfo("  eDMA Channel %u TCD Registers:\n", chan);
  dmainfo("       SADDR: %08x\n", (unsigned int)regs->saddr);
  dmainfo("        SOFF: %04x\n", (unsigned int)regs->soff);
  dmainfo("        ATTR: %04x\n", (unsigned int)regs->attr);
  dmainfo("        NBML: %05x\n", (unsigned int)regs->nbml);
  dmainfo("       SLAST: %05x\n", (unsigned int)regs->slast);
  dmainfo("       DADDR: %05x\n", (unsigned int)regs->daddr);
  dmainfo("        DOFF: %04x\n", (unsigned int)regs->doff);
  dmainfo("       CITER: %04x\n", (unsigned int)regs->citer);
  dmainfo("    DLASTSGA: %08x\n", (unsigned int)regs->dlastsga);
  dmainfo("         CSR: %04x\n", (unsigned int)regs->csr);
  dmainfo("       BITER: %04x\n", (unsigned int)regs->biter);

  /* DMAMUX registers */

  dmainfo("  DMAMUX Channel %u Registers:\n", chan);
  dmainfo("      DMAMUX: %08x\n", (unsigned int)regs->dmamux);
}
#endif /* CONFIG_DEBUG_DMA */
#endif /* CONFIG_S32K3XX_EDMA */
